backend/app/controllers/messages_controller.rb

  def index
    messages = Message.all
---
SELECT "messages".* FROM "messages"

  def show
    message = Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]