backend/app/controllers/api/v1/messages_controller.rb

SELECT "messages".* FROM "messages"
---
     def index
          respond_with Message.all

INSERT INTO "messages" ("id", "detail") VALUES (?, ?)  [["id", 2], ["detail", ""]]
---
        def create
          respond_with :api, :v1, Message.create(message_params)