backend/app/controllers/api/v1/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY "messages"."detail" ASC
---
      def index
        @messages = Message.all.order(detail: :asc)